<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"2ab6adadf52efa6679a2ed7e84b4e148a6bad2413d29e9c5383cd493da4581ce","plan_job_ref":"Job Staging Environment #65 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/7241169039","plan_hash":"047ab084797e74023399b3e8a4863bb3b84bb53b5ee6372ca4452ef6e9572866","plan_text_format":"text","version":"1.38.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::dev-portfolio-website-2.0",
              + "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
          + sid       = "Allowing Cloudfront to access private S3 Bucket"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "EOUIG3G6N7CQQ"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ cloudfront_default_certificate = false -> true
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::dev-portfolio-website-2.0/*",
                          - "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
                      - Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_object.object will be updated in-place
  ~ resource "aws_s3_object" "object" {
      ~ etag                   = "0eef909ed120e63ab35fbc8f6f863243" -> "88d1c45c89eb9fda8d4c775e122e9d36"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "********************************" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #65](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/7241169039)